{"class_name": "Sequential", "keras_version": "2.0.9", "config": [{"class_name": "LSTM", "config": {"go_backwards": false, "trainable": true, "dtype": "float32", "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "dropout": 0.0, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "recurrent_regularizer": null, "units": 64, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "implementation": 1, "activity_regularizer": null, "name": "lstm_1", "activation": "tanh", "recurrent_dropout": 0.0, "return_state": false, "unit_forget_bias": true, "return_sequences": false, "kernel_regularizer": null, "batch_input_shape": [null, 10, 5]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "noise_shape": null, "seed": null, "rate": 0.2, "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "activation": "relu", "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "units": 16, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "activation": "relu", "name": "dense_2", "kernel_constraint": null, "bias_regularizer": null, "units": 1, "kernel_regularizer": null}}], "backend": "tensorflow"}