{"backend": "tensorflow", "config": [{"config": {"kernel_constraint": null, "stateful": false, "name": "lstm_1", "bias_regularizer": null, "units": 64, "unit_forget_bias": true, "unroll": false, "return_state": false, "activation": "tanh", "dropout": 0.0, "go_backwards": false, "bias_constraint": null, "return_sequences": false, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "implementation": 1, "recurrent_dropout": 0.0, "kernel_regularizer": null, "use_bias": true, "recurrent_constraint": null, "batch_input_shape": [null, 10, 5], "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dtype": "float32"}, "class_name": "LSTM"}, {"config": {"name": "dropout_1", "seed": null, "trainable": true, "noise_shape": null, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"minval": -0.05, "seed": null, "maxval": 0.05}, "class_name": "RandomUniform"}, "trainable": true, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "bias_regularizer": null, "kernel_regularizer": null, "units": 16, "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"minval": -0.05, "seed": null, "maxval": 0.05}, "class_name": "RandomUniform"}, "trainable": true, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "bias_regularizer": null, "kernel_regularizer": null, "units": 1, "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.1.4"}