{"config": [{"config": {"recurrent_regularizer": null, "bias_regularizer": null, "recurrent_dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "dtype": "float32", "return_sequences": false, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "dropout": 0.0, "unroll": false, "trainable": true, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "recurrent_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "batch_input_shape": [null, 10, 5], "activation": "tanh", "implementation": 1, "stateful": false, "units": 64, "kernel_constraint": null, "unit_forget_bias": true, "return_state": false, "name": "lstm_1", "go_backwards": false}, "class_name": "LSTM"}, {"config": {"trainable": true, "seed": null, "rate": 0.3, "name": "dropout_1", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"maxval": 0.05, "minval": -0.05, "seed": null}, "class_name": "RandomUniform"}, "use_bias": true, "units": 16}, "class_name": "Dense"}, {"config": {"trainable": true, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"maxval": 0.05, "minval": -0.05, "seed": null}, "class_name": "RandomUniform"}, "use_bias": true, "units": 1}, "class_name": "Dense"}], "keras_version": "2.1.4", "class_name": "Sequential", "backend": "tensorflow"}