{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.4", "config": [{"class_name": "LSTM", "config": {"recurrent_regularizer": null, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 1, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "trainable": true, "recurrent_constraint": null, "kernel_constraint": null, "bias_constraint": null, "dtype": "float32", "return_sequences": false, "activity_regularizer": null, "batch_input_shape": [null, 10, 5], "name": "lstm_2", "recurrent_activation": "hard_sigmoid", "return_state": false, "kernel_regularizer": null, "activation": "tanh", "use_bias": true, "bias_regularizer": null, "units": 64, "dropout": 0.0, "unit_forget_bias": true, "recurrent_dropout": 0.0, "go_backwards": false}}, {"class_name": "Dropout", "config": {"noise_shape": null, "seed": null, "name": "dropout_2", "rate": 0.2, "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_3", "use_bias": true, "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "units": 16, "bias_constraint": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_4", "use_bias": true, "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "units": 1, "bias_constraint": null}}]}